77 WS-OPCAO          PIC X(02) VALUE SPACES.
PERFORM RECEBER-OPCAO UNTIL WS-OPCAO NOT EQUAL SPACES.


******
77 WS-DATA-SISTEMA   PIC X(19) VALUE SPACE.

01 DATA-SISTEMA.
          02 ANO   PIC 9(04).
          02 MES   PIC 9(02).
          02 DIA   PIC 9(02).
          02 HORA  PIC 9(02).
          02 MIN   PIC 9(02).
          02 SEG   PIC 9(02).



EXIBIR-HORARIO.
           MOVE FUNCTION CURRENT-DATE TO DATA-SISTEMA.
           STRING 
               DIA  DELIMITED BY SPACES '/' DELIMITED BY SIZE
               MES  DELIMITED BY SPACES '/' DELIMITED BY SIZE
               ANO  DELIMITED BY SPACES ' ' DELIMITED BY SIZE
               HORA DELIMITED BY SPACES ':' DELIMITED BY SIZE
               MIN  DELIMITED BY SPACES ':' DELIMITED BY SIZE
               SEG  DELIMITED BY SPACES ':' DELIMITED BY SIZE
           INTO
               WS-DATA-SISTEMA.

*****
USAR FUNÇÃO PARA RAIZ QUADRADA

FUNCTION SQRT(DELTA)
COMPUTE  X1 =(- NB + FUNCTION SQRT(DELTA)/(2 * NA))

*****
OUTROS TIPOS DE MASCARAS - VERIFICAR SE FUNCIONA PARA ESTE COMPILADOR.

77 MASC-CPF          PIC ZZZ.ZZZ.ZZZBZZ.
77 MASC-TEL          PIC ZZBZZZZZBZZZZ.

O "B" VAI COLOCAR O CARACTER "-"

***
DEFINIR UMA VARIÁVEL PARA ACEITAR NÚMERO NEGATIVO

02 WS-SALDO          PIC S9(06)V99.
02 WS-LIMITE         PIC S9(06)V99.